1/1: Building EqTest (EqTest.idr)
EqTest> EqTest.eqImplMyNat : Eq MyNat
eqImplMyNat = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplMyNatFun (\x, y => not (x == y))
EqTest> EqTest.eqImplMyNatFun : MyNat -> MyNat -> Bool
eqImplMyNatFun MZ MZ = True
eqImplMyNatFun (MS a0_1) (MS a0_2) = a0_1 == a0_2
eqImplMyNatFun _ _ = False
EqTest> EqTest.eqImplFoo1 : Eq arg3579 => Eq (Foo1 arg3579)
eqImplFoo1 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo1Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo1Fun : Eq arg3579 => Foo1 arg3579 -> Foo1 arg3579 -> Bool
eqImplFoo1Fun Bor1 Bor1 = True
eqImplFoo1Fun _ _ = False
EqTest> EqTest.eqImplFoo2 : Eq arg3621 => Eq (Foo2 arg3621)
eqImplFoo2 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo2Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo2Fun : Eq arg3621 => Foo2 arg3621 -> Foo2 arg3621 -> Bool
eqImplFoo2Fun (Bor2 a0_1) (Bor2 a0_2) = a0_1 == a0_2
eqImplFoo2Fun _ _ = False
EqTest> EqTest.eqImplFoo4 : Eq arg3672 => Eq arg3673 => Eq (Foo4 arg3672 arg3673)
eqImplFoo4 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo4Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo4Fun : Eq arg3672 => Eq arg3673 => Foo4 arg3672 arg3673 -> Foo4 arg3672 arg3673 -> Bool
eqImplFoo4Fun (Bor4 a0_1) (Bor4 a0_2) = a0_1 == a0_2
eqImplFoo4Fun _ _ = False
EqTest> EqTest.eqImplFoo5 : Eq arg3745 => Eq arg3746 => Eq arg3747 => Eq (Foo5 arg3745 arg3746 arg3747)
eqImplFoo5 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo5Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo5Fun : Eq arg3745 => Eq arg3746 => Eq arg3747 => Foo5 arg3745 arg3746 arg3747 -> Foo5 arg3745 arg3746 arg3747 -> Bool
eqImplFoo5Fun (Bor5 a0_1 b0_1 c0_1) (Bor5 a0_2 b0_2 c0_2) = (a0_1 == a0_2) && Delay ((b0_1 == b0_2) && Delay (c0_1 == c0_2))
eqImplFoo5Fun _ _ = False
EqTest> EqTest.eqImplFoo7 : Eq arg3859 => Eq arg3860 => Eq arg3861 => Eq (Foo7 arg3859 arg3860 arg3861)
eqImplFoo7 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo7Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo7Fun : Eq arg3859 => Eq arg3860 => Eq arg3861 => Foo7 arg3859 arg3860 arg3861 -> Foo7 arg3859 arg3860 arg3861 -> Bool
eqImplFoo7Fun (Zor7 a0_1) (Zor7 a0_2) = a0_1 == a0_2
eqImplFoo7Fun (Gor7 a0_1) (Gor7 a0_2) = a0_1 == a0_2
eqImplFoo7Fun (Nor7A a0_1 b0_1) (Nor7A a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFoo7Fun (Nor7B a0_1 b0_1 c0_1) (Nor7B a0_2 b0_2 c0_2) = (a0_1 == a0_2) && Delay ((b0_1 == b0_2) && Delay (c0_1 == c0_2))
eqImplFoo7Fun Bor7 Bor7 = True
eqImplFoo7Fun _ _ = False
EqTest> EqTest.eqImplFoo7' : Eq arg4101 => Eq arg4102 => Eq arg4103 => Eq (Foo7' arg4101 arg4102 arg4103)
eqImplFoo7' = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo7'Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo7'Fun : Eq arg4101 => Eq arg4102 => Eq arg4103 => Foo7' arg4101 arg4102 arg4103 -> Foo7' arg4101 arg4102 arg4103 -> Bool
eqImplFoo7'Fun (Zor7' a0_1) (Zor7' a0_2) = a0_1 == a0_2
eqImplFoo7'Fun (Gor7' a0_1) (Gor7' a0_2) = a0_1 == a0_2
eqImplFoo7'Fun (Nor7' a0_1 b0_1) (Nor7' a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFoo7'Fun Bor7' Bor7' = True
eqImplFoo7'Fun _ _ = False
EqTest> EqTest.eqImplFooN : Eq arg4293 => Eq (FooN arg4292 arg4293)
eqImplFooN = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFooNFun (\x, y => not (x == y))
EqTest> EqTest.eqImplFooNFun : Eq arg4293 => FooN arg4292 arg4293 -> FooN arg4292 arg4293 -> Bool
eqImplFooNFun (BorZ a0_1) (BorZ a0_2) = a0_1 == a0_2
eqImplFooNFun (BorS a0_1) (BorS a0_2) = a0_1 == a0_2
eqImplFooNFun (BorNA a0_1 b0_1) (BorNA a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFooNFun (BorNB arg4292 b0_1) (BorNB arg4292 b0_2) = b0_1 == b0_2
eqImplFooNFun _ _ = False
EqTest> EqTest.eqImplFoo6 : Eq arg4421 => Eq arg4422 => Eq arg4423 => Eq (Foo6 arg4421 arg4422 arg4423 arg4424)
eqImplFoo6 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo6Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo6Fun : Eq arg4421 => Eq arg4422 => Eq arg4423 => Foo6 arg4421 arg4422 arg4423 arg4424 -> Foo6 arg4421 arg4422 arg4423 arg4424 -> Bool
eqImplFoo6Fun (Zor6 a0_1 b0_1) (Zor6 a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFoo6Fun (Gor6 a0_1) (Gor6 a0_2) = a0_1 == a0_2
eqImplFoo6Fun (Nor6A a0_1 b0_1 c0_1) (Nor6A a0_2 b0_2 c0_2) = (a0_1 == a0_2) && Delay ((b0_1 == b0_2) && Delay (c0_1 == c0_2))
eqImplFoo6Fun (Nor6B a0_1 _ c0_1) (Nor6B a0_2 _ c0_2) = (a0_1 == a0_2) && Delay (c0_1 == c0_2)
eqImplFoo6Fun Bor6A Bor6A = True
eqImplFoo6Fun (Bor6B a0_1) (Bor6B a0_2) = a0_1 == a0_2
eqImplFoo6Fun (Wah6 a0_1 arg4424) (Wah6 a0_2 arg4424) = a0_1 == a0_2
eqImplFoo6Fun _ _ = False
EqTest> EqTest.eqImplFoo6' : Eq arg4784 => Eq arg4785 => Eq arg4786 => Eq (Foo6' arg4784 arg4785 arg4786 arg4787)
eqImplFoo6' = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo6'Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo6'Fun : Eq arg4784 => Eq arg4785 => Eq arg4786 => Foo6' arg4784 arg4785 arg4786 arg4787 -> Foo6' arg4784 arg4785 arg4786 arg4787 -> Bool
eqImplFoo6'Fun (Zor6' a0_1 b0_1) (Zor6' a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFoo6'Fun (Gor6A' a0_1) (Gor6A' a0_2) = a0_1 == a0_2
eqImplFoo6'Fun (Gor6B' _ b0_1) (Gor6B' _ b0_2) = b0_1 == b0_2
eqImplFoo6'Fun (Nor6A' a0_1 b0_1 c0_1) (Nor6A' a0_2 b0_2 c0_2) = (a0_1 == a0_2) && Delay ((b0_1 == b0_2) && Delay (c0_1 == c0_2))
eqImplFoo6'Fun (Nor6B' a0_1 _ c0_1) (Nor6B' a0_2 _ c0_2) = (a0_1 == a0_2) && Delay (c0_1 == c0_2)
eqImplFoo6'Fun Bor6' Bor6' = True
eqImplFoo6'Fun (Wah6' a0_1 arg4787) (Wah6' a0_2 arg4787) = a0_1 == a0_2
eqImplFoo6'Fun (Kah6' a0_1 arg4787 _) (Kah6' a0_2 arg4787 _) = a0_1 == a0_2
eqImplFoo6'Fun (Pah6' a0_1 arg4787 c0_1 _) (Pah6' a0_2 arg4787 c0_2 _) = (a0_1 == a0_2) && Delay (c0_1 == c0_2)
eqImplFoo6'Fun _ _ = False
EqTest> EqTest> 
Bye for now!
