1/1: Building EqTest (EqTest.idr)
EqTest> EqTest.eqImplMyNat : Eq MyNat
eqImplMyNat = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplMyNatFun (\x, y => not (x == y))
EqTest> EqTest.eqImplMyNatFun : MyNat -> MyNat -> Bool
eqImplMyNatFun MZ MZ = True
eqImplMyNatFun (MS a0_1) (MS a0_2) = a0_1 == a0_2
eqImplMyNatFun _ _ = False
EqTest> EqTest.eqImplFoo1 : Eq arg3269 => Eq (Foo1 arg3269)
eqImplFoo1 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo1Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo1Fun : Eq arg3269 => Foo1 arg3269 -> Foo1 arg3269 -> Bool
eqImplFoo1Fun Bor1 Bor1 = True
eqImplFoo1Fun _ _ = False
EqTest> EqTest.eqImplFoo2 : Eq arg3311 => Eq (Foo2 arg3311)
eqImplFoo2 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo2Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo2Fun : Eq arg3311 => Foo2 arg3311 -> Foo2 arg3311 -> Bool
eqImplFoo2Fun (Bor2 a0_1) (Bor2 a0_2) = a0_1 == a0_2
eqImplFoo2Fun _ _ = False
EqTest> EqTest.eqImplFoo4 : Eq arg3362 => Eq arg3363 => Eq (Foo4 arg3362 arg3363)
eqImplFoo4 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo4Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo4Fun : Eq arg3362 => Eq arg3363 => Foo4 arg3362 arg3363 -> Foo4 arg3362 arg3363 -> Bool
eqImplFoo4Fun (Bor4 a0_1) (Bor4 a0_2) = a0_1 == a0_2
eqImplFoo4Fun _ _ = False
EqTest> EqTest.eqImplFoo5 : Eq arg3435 => Eq arg3436 => Eq arg3437 => Eq (Foo5 arg3435 arg3436 arg3437)
eqImplFoo5 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo5Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo5Fun : Eq arg3435 => Eq arg3436 => Eq arg3437 => Foo5 arg3435 arg3436 arg3437 -> Foo5 arg3435 arg3436 arg3437 -> Bool
eqImplFoo5Fun (Bor5 a0_1 b0_1 c0_1) (Bor5 a0_2 b0_2 c0_2) = (a0_1 == a0_2) && Delay ((b0_1 == b0_2) && Delay (c0_1 == c0_2))
eqImplFoo5Fun _ _ = False
EqTest> EqTest.eqImplFoo7 : Eq arg3549 => Eq arg3550 => Eq arg3551 => Eq (Foo7 arg3549 arg3550 arg3551)
eqImplFoo7 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo7Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo7Fun : Eq arg3549 => Eq arg3550 => Eq arg3551 => Foo7 arg3549 arg3550 arg3551 -> Foo7 arg3549 arg3550 arg3551 -> Bool
eqImplFoo7Fun (Zor7 a0_1) (Zor7 a0_2) = a0_1 == a0_2
eqImplFoo7Fun (Gor7 a0_1) (Gor7 a0_2) = a0_1 == a0_2
eqImplFoo7Fun (Nor7A a0_1 b0_1) (Nor7A a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFoo7Fun (Nor7B a0_1 b0_1 c0_1) (Nor7B a0_2 b0_2 c0_2) = (a0_1 == a0_2) && Delay ((b0_1 == b0_2) && Delay (c0_1 == c0_2))
eqImplFoo7Fun Bor7 Bor7 = True
eqImplFoo7Fun _ _ = False
EqTest> EqTest.eqImplFoo7' : Eq arg3791 => Eq arg3792 => Eq arg3793 => Eq (Foo7' arg3791 arg3792 arg3793)
eqImplFoo7' = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo7'Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo7'Fun : Eq arg3791 => Eq arg3792 => Eq arg3793 => Foo7' arg3791 arg3792 arg3793 -> Foo7' arg3791 arg3792 arg3793 -> Bool
eqImplFoo7'Fun (Zor7' a0_1) (Zor7' a0_2) = a0_1 == a0_2
eqImplFoo7'Fun (Gor7' a0_1) (Gor7' a0_2) = a0_1 == a0_2
eqImplFoo7'Fun (Nor7' a0_1 b0_1) (Nor7' a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFoo7'Fun Bor7' Bor7' = True
eqImplFoo7'Fun _ _ = False
EqTest> EqTest.eqImplFooN : Eq arg3983 => Eq (FooN arg3982 arg3983)
eqImplFooN = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFooNFun (\x, y => not (x == y))
EqTest> EqTest.eqImplFooNFun : Eq arg3983 => FooN arg3982 arg3983 -> FooN arg3982 arg3983 -> Bool
eqImplFooNFun (BorZ a0_1) (BorZ a0_2) = a0_1 == a0_2
eqImplFooNFun (BorS a0_1) (BorS a0_2) = a0_1 == a0_2
eqImplFooNFun (BorNA a0_1 b0_1) (BorNA a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFooNFun (BorNB arg3982 b0_1) (BorNB arg3982 b0_2) = b0_1 == b0_2
eqImplFooNFun _ _ = False
EqTest> EqTest.eqImplFoo6 : Eq arg4111 => Eq arg4112 => Eq arg4113 => Eq (Foo6 arg4111 arg4112 arg4113 arg4114)
eqImplFoo6 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo6Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo6Fun : Eq arg4111 => Eq arg4112 => Eq arg4113 => Foo6 arg4111 arg4112 arg4113 arg4114 -> Foo6 arg4111 arg4112 arg4113 arg4114 -> Bool
eqImplFoo6Fun (Zor6 a0_1 b0_1) (Zor6 a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFoo6Fun (Gor6 a0_1) (Gor6 a0_2) = a0_1 == a0_2
eqImplFoo6Fun (Nor6A a0_1 b0_1 c0_1) (Nor6A a0_2 b0_2 c0_2) = (a0_1 == a0_2) && Delay ((b0_1 == b0_2) && Delay (c0_1 == c0_2))
eqImplFoo6Fun (Nor6B a0_1 _ c0_1) (Nor6B a0_2 _ c0_2) = (a0_1 == a0_2) && Delay (c0_1 == c0_2)
eqImplFoo6Fun Bor6A Bor6A = True
eqImplFoo6Fun (Bor6B a0_1) (Bor6B a0_2) = a0_1 == a0_2
eqImplFoo6Fun (Wah6 a0_1 arg4114) (Wah6 a0_2 arg4114) = a0_1 == a0_2
eqImplFoo6Fun _ _ = False
EqTest> EqTest.eqImplFoo6' : Eq arg4474 => Eq arg4475 => Eq arg4476 => Eq (Foo6' arg4474 arg4475 arg4476 arg4477)
eqImplFoo6' = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo6'Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo6'Fun : Eq arg4474 => Eq arg4475 => Eq arg4476 => Foo6' arg4474 arg4475 arg4476 arg4477 -> Foo6' arg4474 arg4475 arg4476 arg4477 -> Bool
eqImplFoo6'Fun (Zor6' a0_1 b0_1) (Zor6' a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFoo6'Fun (Gor6A' a0_1) (Gor6A' a0_2) = a0_1 == a0_2
eqImplFoo6'Fun (Gor6B' _ b0_1) (Gor6B' _ b0_2) = b0_1 == b0_2
eqImplFoo6'Fun (Nor6A' a0_1 b0_1 c0_1) (Nor6A' a0_2 b0_2 c0_2) = (a0_1 == a0_2) && Delay ((b0_1 == b0_2) && Delay (c0_1 == c0_2))
eqImplFoo6'Fun (Nor6B' a0_1 _ c0_1) (Nor6B' a0_2 _ c0_2) = (a0_1 == a0_2) && Delay (c0_1 == c0_2)
eqImplFoo6'Fun Bor6' Bor6' = True
eqImplFoo6'Fun (Wah6' a0_1 arg4477) (Wah6' a0_2 arg4477) = a0_1 == a0_2
eqImplFoo6'Fun (Kah6' a0_1 arg4477 _) (Kah6' a0_2 arg4477 _) = a0_1 == a0_2
eqImplFoo6'Fun (Pah6' a0_1 arg4477 c0_1 _) (Pah6' a0_2 arg4477 c0_2 _) = (a0_1 == a0_2) && Delay (c0_1 == c0_2)
eqImplFoo6'Fun _ _ = False
EqTest> EqTest> 
Bye for now!
