1/1: Building EqTest (EqTest.idr)
EqTest> EqTest.eqImplMyNat : Eq MyNat
eqImplMyNat = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplMyNatFun (\x, y => not (x == y))
EqTest> EqTest.eqImplMyNatFun : MyNat -> MyNat -> Bool
eqImplMyNatFun MZ MZ = True
eqImplMyNatFun (MS a0_1) (MS a0_2) = a0_1 == a0_2
eqImplMyNatFun _ _ = False
EqTest> EqTest.eqImplFoo1 : Eq arg3583 => Eq (Foo1 arg3583)
eqImplFoo1 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo1Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo1Fun : Eq arg3583 => Foo1 arg3583 -> Foo1 arg3583 -> Bool
eqImplFoo1Fun Bor1 Bor1 = True
eqImplFoo1Fun _ _ = False
EqTest> EqTest.eqImplFoo2 : Eq arg3625 => Eq (Foo2 arg3625)
eqImplFoo2 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo2Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo2Fun : Eq arg3625 => Foo2 arg3625 -> Foo2 arg3625 -> Bool
eqImplFoo2Fun (Bor2 a0_1) (Bor2 a0_2) = a0_1 == a0_2
eqImplFoo2Fun _ _ = False
EqTest> EqTest.eqImplFoo4 : Eq arg3676 => Eq arg3677 => Eq (Foo4 arg3676 arg3677)
eqImplFoo4 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo4Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo4Fun : Eq arg3676 => Eq arg3677 => Foo4 arg3676 arg3677 -> Foo4 arg3676 arg3677 -> Bool
eqImplFoo4Fun (Bor4 a0_1) (Bor4 a0_2) = a0_1 == a0_2
eqImplFoo4Fun _ _ = False
EqTest> EqTest.eqImplFoo5 : Eq arg3749 => Eq arg3750 => Eq arg3751 => Eq (Foo5 arg3749 arg3750 arg3751)
eqImplFoo5 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo5Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo5Fun : Eq arg3749 => Eq arg3750 => Eq arg3751 => Foo5 arg3749 arg3750 arg3751 -> Foo5 arg3749 arg3750 arg3751 -> Bool
eqImplFoo5Fun (Bor5 a0_1 b0_1 c0_1) (Bor5 a0_2 b0_2 c0_2) = (a0_1 == a0_2) && Delay ((b0_1 == b0_2) && Delay (c0_1 == c0_2))
eqImplFoo5Fun _ _ = False
EqTest> EqTest.eqImplFoo7 : Eq arg3863 => Eq arg3864 => Eq arg3865 => Eq (Foo7 arg3863 arg3864 arg3865)
eqImplFoo7 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo7Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo7Fun : Eq arg3863 => Eq arg3864 => Eq arg3865 => Foo7 arg3863 arg3864 arg3865 -> Foo7 arg3863 arg3864 arg3865 -> Bool
eqImplFoo7Fun (Zor7 a0_1) (Zor7 a0_2) = a0_1 == a0_2
eqImplFoo7Fun (Gor7 a0_1) (Gor7 a0_2) = a0_1 == a0_2
eqImplFoo7Fun (Nor7A a0_1 b0_1) (Nor7A a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFoo7Fun (Nor7B a0_1 b0_1 c0_1) (Nor7B a0_2 b0_2 c0_2) = (a0_1 == a0_2) && Delay ((b0_1 == b0_2) && Delay (c0_1 == c0_2))
eqImplFoo7Fun Bor7 Bor7 = True
eqImplFoo7Fun _ _ = False
EqTest> EqTest.eqImplFoo7' : Eq arg4105 => Eq arg4106 => Eq arg4107 => Eq (Foo7' arg4105 arg4106 arg4107)
eqImplFoo7' = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo7'Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo7'Fun : Eq arg4105 => Eq arg4106 => Eq arg4107 => Foo7' arg4105 arg4106 arg4107 -> Foo7' arg4105 arg4106 arg4107 -> Bool
eqImplFoo7'Fun (Zor7' a0_1) (Zor7' a0_2) = a0_1 == a0_2
eqImplFoo7'Fun (Gor7' a0_1) (Gor7' a0_2) = a0_1 == a0_2
eqImplFoo7'Fun (Nor7' a0_1 b0_1) (Nor7' a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFoo7'Fun Bor7' Bor7' = True
eqImplFoo7'Fun _ _ = False
EqTest> EqTest.eqImplFooN : Eq arg4297 => Eq (FooN arg4296 arg4297)
eqImplFooN = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFooNFun (\x, y => not (x == y))
EqTest> EqTest.eqImplFooNFun : Eq arg4297 => FooN arg4296 arg4297 -> FooN arg4296 arg4297 -> Bool
eqImplFooNFun (BorZ a0_1) (BorZ a0_2) = a0_1 == a0_2
eqImplFooNFun (BorS a0_1) (BorS a0_2) = a0_1 == a0_2
eqImplFooNFun (BorNA a0_1 b0_1) (BorNA a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFooNFun (BorNB arg4296 b0_1) (BorNB arg4296 b0_2) = b0_1 == b0_2
eqImplFooNFun _ _ = False
EqTest> EqTest.eqImplFoo6 : Eq arg4425 => Eq arg4426 => Eq arg4427 => Eq (Foo6 arg4425 arg4426 arg4427 arg4428)
eqImplFoo6 = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo6Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo6Fun : Eq arg4425 => Eq arg4426 => Eq arg4427 => Foo6 arg4425 arg4426 arg4427 arg4428 -> Foo6 arg4425 arg4426 arg4427 arg4428 -> Bool
eqImplFoo6Fun (Zor6 a0_1 b0_1) (Zor6 a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFoo6Fun (Gor6 a0_1) (Gor6 a0_2) = a0_1 == a0_2
eqImplFoo6Fun (Nor6A a0_1 b0_1 c0_1) (Nor6A a0_2 b0_2 c0_2) = (a0_1 == a0_2) && Delay ((b0_1 == b0_2) && Delay (c0_1 == c0_2))
eqImplFoo6Fun (Nor6B a0_1 _ c0_1) (Nor6B a0_2 _ c0_2) = (a0_1 == a0_2) && Delay (c0_1 == c0_2)
eqImplFoo6Fun Bor6A Bor6A = True
eqImplFoo6Fun (Bor6B a0_1) (Bor6B a0_2) = a0_1 == a0_2
eqImplFoo6Fun (Wah6 a0_1 arg4428) (Wah6 a0_2 arg4428) = a0_1 == a0_2
eqImplFoo6Fun _ _ = False
EqTest> EqTest.eqImplFoo6' : Eq arg4788 => Eq arg4789 => Eq arg4790 => Eq (Foo6' arg4788 arg4789 arg4790 arg4791)
eqImplFoo6' = Eq at Prelude/EqOrd.idr:13:1--22:7 eqImplFoo6'Fun (\x, y => not (x == y))
EqTest> EqTest.eqImplFoo6'Fun : Eq arg4788 => Eq arg4789 => Eq arg4790 => Foo6' arg4788 arg4789 arg4790 arg4791 -> Foo6' arg4788 arg4789 arg4790 arg4791 -> Bool
eqImplFoo6'Fun (Zor6' a0_1 b0_1) (Zor6' a0_2 b0_2) = (a0_1 == a0_2) && Delay (b0_1 == b0_2)
eqImplFoo6'Fun (Gor6A' a0_1) (Gor6A' a0_2) = a0_1 == a0_2
eqImplFoo6'Fun (Gor6B' _ b0_1) (Gor6B' _ b0_2) = b0_1 == b0_2
eqImplFoo6'Fun (Nor6A' a0_1 b0_1 c0_1) (Nor6A' a0_2 b0_2 c0_2) = (a0_1 == a0_2) && Delay ((b0_1 == b0_2) && Delay (c0_1 == c0_2))
eqImplFoo6'Fun (Nor6B' a0_1 _ c0_1) (Nor6B' a0_2 _ c0_2) = (a0_1 == a0_2) && Delay (c0_1 == c0_2)
eqImplFoo6'Fun Bor6' Bor6' = True
eqImplFoo6'Fun (Wah6' a0_1 arg4791) (Wah6' a0_2 arg4791) = a0_1 == a0_2
eqImplFoo6'Fun (Kah6' a0_1 arg4791 _) (Kah6' a0_2 arg4791 _) = a0_1 == a0_2
eqImplFoo6'Fun (Pah6' a0_1 arg4791 c0_1 _) (Pah6' a0_2 arg4791 c0_2 _) = (a0_1 == a0_2) && Delay (c0_1 == c0_2)
eqImplFoo6'Fun _ _ = False
EqTest> EqTest> 
Bye for now!
